Data Cleaning Practice

In [4]:
import pandas as pd

1️⃣ Handling Missing Values

In [5]:
data = pd.read_csv("../DataSets/Titanic-Dataset.csv")
df = pd.DataFrame(data)
df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [86]:
# missing values or duplicates check
#missing value check
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [87]:
df["Age"] = df["Age"].fillna(df["Age"].median()).astype("int64")

In [88]:
df["Cabin"] = df["Cabin"].fillna("Unkown")
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [89]:
df["Embarked"] = df["Embarked"].fillna(df["Embarked"].mode()[0])
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

Remove Duplicate values

In [90]:
df.duplicated().sum()

np.int64(0)

Data type connverstion

In [103]:
df["Pclass"] = df["Pclass"].astype("category")
df["Sex"] = df["Sex"].astype("category")
df["Embarked"] = df["Embarked"].astype("category")

In [100]:
df.dtypes

PassengerId       int64
Survived          int64
Pclass         category
Name             object
Sex            category
Age               int64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

String/Text Cleaning

In [101]:
df["Name"] = df["Name"].str.strip().str.title()
df["Sex"] = df["Sex"].str.lower()
df["Cabin"] = df["Cabin"].str.strip()
df["Ticket"] = df["Ticket"].str.strip()

In [105]:
df.info()
df.isnull().sum()
df.to_csv("titanic_cleaned.csv", index=False)
df.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    category
 3   Name         891 non-null    object
 4   Sex          891 non-null    category
 5   Age          891 non-null    int64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        891 non-null    object
 11  Embarked     891 non-null    category
dtypes: category(3), float64(1), int64(5), object(3)
memory usage: 65.8+ KB

PassengerId       int64
Survived          int64
Pclass         category
Name             object
Sex            category
Age               int64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Cabin            object
Embarked       category
dtype: object

In [17]:
data = pd.read_csv("titanic_cleaned.csv")
dataset = pd.DataFrame(data)

dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,Unkown,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,Unkown,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,Unkown,S

In [18]:
dataset[["Age","Name","Sex","Ticket"]]

,Age,Name,Sex,Ticket
0,22,"Braund, Mr. Owen Harris",male,A/5 21171
1,38,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599
2,26,"Heikkinen, Miss. Laina",female,STON/O2. 3101282
3,35,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803
4,35,"Allen, Mr. William Henry",male,373450
...,...,...,...,...
886,27,"Montvila, Rev. Juozas",male,211536
887,19,"Graham, Miss. Margaret Edith",female,112053
888,28,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607
889,26,"Behr, Mr. Karl Howell",male,111369
890,32,"Dooley, Mr. Patrick",male,370376

In [20]:
dataset.iloc[5:9]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,28,0,0,330877,8.4583,Unkown,Q
6,7,0,1,"Mccarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,Unkown,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,Unkown,S

In [24]:
dataset.loc[3:10]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,Unkown,S
5,6,0,3,"Moran, Mr. James",male,28,0,0,330877,8.4583,Unkown,Q
6,7,0,1,"Mccarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,Unkown,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,Unkown,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,Unkown,C
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4,1,1,PP 9549,16.7000,G6,S

In [29]:
dataset[dataset["Age"] > 70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71,0,0,PC 17754,34.6542,A5,C
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71,0,0,PC 17609,49.5042,Unkown,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74,0,0,347060,7.7750,Unkown,S

In [39]:
dataset[(dataset["Sex"]  == "male") & (dataset["Embarked"] == "S")]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,Unkown,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,Unkown,S
6,7,0,1,"Mccarthy, Mr. Timothy J",male,54,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2,3,1,349909,21.0750,Unkown,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20,0,0,A/5. 2151,8.0500,Unkown,S
...,...,...,...,...,...,...,...,...,...,...,...,...
878,879,0,3,"Laleff, Mr. Kristo",male,28,0,0,349217,7.8958,Unkown,S
881,882,0,3,"Markun, Mr. Johann",male,33,0,0,349257,7.8958,Unkown,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28,0,0,C.A./SOTON 34068,10.5000,Unkown,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25,0,0,SOTON/OQ 392076,7.0500,Unkown,S
886,887,0,2,"Montvila, Rev. Juozas",male,27,0,0,211536,13.0000,Unkown,S